RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc555x.h
/*
 * Modifications of the original file provided by Freescale are:
 *
 * Copyright (c) 2011 embedded brains GmbH.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**************************************************************************/
/* FILE NAME: mpc5554.h                      COPYRIGHT (c) Freescale 2007 */
/* VERSION:  1.7                                  All Rights Reserved     */
/*                                                                        */
/* DESCRIPTION:                                                           */
/* This file contain all of the register and bit field definitions for    */
/* MPC5554.                                                               */
/*========================================================================*/
/* UPDATE HISTORY                                                         */
/* REV      AUTHOR      DATE       DESCRIPTION OF CHANGE                  */
/* ---   -----------  ---------    ---------------------                  */
/* 0.01  J. Loeliger  03/Mar/03    Initial version of file for MPC5554.   */
/*                                  Based on SoC version 0.7.             */
/* 0.02  J. Loeliger  05/Mar/03    All registers and bit fields now       */
/*                                  defined.                              */
/* 0.03  J. Loeliger  05/May/03    Updated to current spec., fixed several*/
/*                                   bugs and naming/formating issues.    */
/* 0.04  J. Loeliger  16/May/03    More fixes and naming/formating issues.*/
/* 0.05  J. Loeliger  19/Aug/03    Updated for latest documentation.      */
/* 0.06  J. Loeliger  03/Sep/03    Changed to include motint.h            */
/*                                  Updated many register names.          */
/* 0.07  J. Loeliger  04/Nov/03    Changed to include typedefs.h and more */
/*                                  register name updates.                */
/* 0.08  J. Loeliger  25/Feb/04    Added MetroWerks #pragmas.             */
/*                                  Updated for user manual 1.0           */
/* 0.09  J. Loeliger  27/Feb/04    Updated eDMA tcd section and some more */
/*                                  bit field names to match user's man.  */
/* 0.10  J. Loeliger  01/Apr/04    Fixed register spacing in ADC and eTPU */
/* 0.11  J. Loeliger  16/Jun/04    Many fixes and updated to user's       */
/*                                  manual, also some testing done.       */
/* 0.12  J. Loeliger  25/Jun/04    Fixed problems in edma and eTPU.       */
/* 0.13  J. Loeliger  16/Jul/04    Fixed mistake in FlexCAN TIMER size and*/
/*                                  changed eTPU memory defs to start with*/
/*                                  ETPU_                                 */
/* 0.14  J. Loeliger  17/Nov/04    Added ETPU_CODE_RAM definition.        */
/*                                  All code moved to CVS repository.     */
/*                                  Updated copyright to Freescale.       */
/*                                  Added new SCMOFFDATAR register to eTPU*/
/*                                  Fixed REDCR_A&B bit fields in eTPU.   */
/*                                  Added new DBR bit in CTAR for DSPI.   */
/* 0.15  J. Loeliger  29/Nov/04    Added support for new eTPU util funcs. */
/*                                  Added bit fields for FlexCAN buffer ID*/
/* 0.16  J. Loeliger  01/Dec/04    Corrected comments in  release 0.16.   */
/* 0.17  J. Loeliger  02/Dec/04    Moved eTPU variable definitions to a   */
/*                                   seperate new file.                   */
/*                                   Removed SIU variable the GPIO        */
/*                                   routines do not need it.             */
/* 1.0  G.Emerson     22/Feb/05    No real changes to this file.          */
/*                                 Joint generation with mpc5553.h        */
/* 1.1   G. Emerson   6/Jun/05     Changes to SIU to allow for upward     */
/*                                 expansion of PCR/GPDI/GPDO             */
/*                                 Added #defines for memory sizes etc    */
/* 1.2   G. Emerson   21/Sep/05    PBRIDGES fixes                         */
/* 1.3   G. Emerson   03/Jan/06    Pbridge MPCR/PACR/OPACR now generic    */
/*                                 XBAR MPR now generic                   */
/*                                 ECSM has FSBMCR on all integrations    */
/* 1.4   G. Emerson   24/Jan/06    Make Pbridges, XBAR, Flash BIU         */
/*                                 integration specific                   */
/* 1.5   S. Mathieson 28/Jul/06    Split out unused bit to support build  */
/*                                 process. No real change.               */
/* 1.6   S. Mathieson 30/Aug/06    SPR: L1SCR0, updated bit name from DPP */
/*                                 to DPB to align with documentation.    */
/* 1.7	 S. Mathieson 26/Feb/07    eDMA TCD format updated to include     */
/*                                 alternate configuration. INTC,         */
/*                                 correction to the number of PSR        */
/*                                 registers.                             */
/**************************************************************************/
/*>>>>NOTE! this file is auto-generated please do not edit it!<<<<*/

#ifndef _MPC5554_H_
#define _MPC5554_H_

#ifndef ASM

#include <stdint.h>

#include <mpc55xx/regs-edma.h>

